anilkumarnagaraj@anis-MacBook-Pro cloudant-service-policy % terraform apply
var.instance_name
  Name of the instance

  Enter a value: test02

var.plan
  plan type (standard and lite)

  Enter a value: standard

var.region
  Provisioning Region

  Enter a value: us-east

var.resource_group
  Enter resource group name

  Enter a value: default

var.resource_key_name
  Name of the instance key

  Enter a value: test_key_02

var.role
  plan type

  Enter a value: Writer

var.service_name
  Name of the service ID

  Enter a value: test_service_02

data.ibm_resource_group.cloudant: Refreshing state...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cloudant-service-policy.ibm_iam_service_id.serviceID[0] will be created
  + resource "ibm_iam_service_id" "serviceID" {
      + crn     = (known after apply)
      + iam_id  = (known after apply)
      + id      = (known after apply)
      + name    = "test_service_02"
      + version = (known after apply)
    }

  # module.cloudant-service-policy.ibm_iam_service_policy.policy will be created
  + resource "ibm_iam_service_policy" "policy" {
      + account_management = false
      + iam_service_id     = (known after apply)
      + id                 = (known after apply)
      + roles              = [
          + "Writer",
        ]

      + resources {
          + resource_instance_id = (known after apply)
          + service              = "cloudantnosqldb"
        }
    }

  # module.cloudant-service-policy.ibm_resource_instance.cloudant_instance[0] will be created
  + resource "ibm_resource_instance" "cloudant_instance" {
      + account_id              = (known after apply)
      + allow_cleanup           = (known after apply)
      + created_at              = (known after apply)
      + created_by              = (known after apply)
      + crn                     = (known after apply)
      + dashboard_url           = (known after apply)
      + deleted_at              = (known after apply)
      + deleted_by              = (known after apply)
      + extensions              = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + last_operation          = (known after apply)
      + location                = "us-east"
      + locked                  = (known after apply)
      + name                    = "test02"
      + plan                    = "standard"
      + plan_history            = (known after apply)
      + resource_aliases_url    = (known after apply)
      + resource_bindings_url   = (known after apply)
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group_crn      = (known after apply)
      + resource_group_id       = "7aecd76f87f54ac0876e2f72f88ccb24"
      + resource_group_name     = (known after apply)
      + resource_id             = (known after apply)
      + resource_keys_url       = (known after apply)
      + resource_name           = (known after apply)
      + resource_plan_id        = (known after apply)
      + resource_status         = (known after apply)
      + restored_at             = (known after apply)
      + restored_by             = (known after apply)
      + scheduled_reclaim_at    = (known after apply)
      + scheduled_reclaim_by    = (known after apply)
      + service                 = "cloudantnosqldb"
      + service_endpoints       = (known after apply)
      + state                   = (known after apply)
      + status                  = (known after apply)
      + sub_type                = (known after apply)
      + tags                    = (known after apply)
      + target_crn              = (known after apply)
      + type                    = (known after apply)
      + update_at               = (known after apply)
      + update_by               = (known after apply)

      + timeouts {}
    }

  # module.cloudant-service-policy.ibm_resource_key.resourceKey[0] will be created
  + resource "ibm_resource_key" "resourceKey" {
      + account_id            = (known after apply)
      + created_at            = (known after apply)
      + created_by            = (known after apply)
      + credentials           = (sensitive value)
      + crn                   = (known after apply)
      + deleted_at            = (known after apply)
      + deleted_by            = (known after apply)
      + guid                  = (known after apply)
      + iam_compatible        = (known after apply)
      + id                    = (known after apply)
      + name                  = "test_key_02"
      + resource_group_id     = (known after apply)
      + resource_instance_id  = (known after apply)
      + resource_instance_url = (known after apply)
      + role                  = "Writer"
      + source_crn            = (known after apply)
      + state                 = (known after apply)
      + status                = (known after apply)
      + updated_at            = (known after apply)
      + updated_by            = (known after apply)
      + url                   = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.cloudant-service-policy.ibm_iam_service_id.serviceID[0]: Creating...
module.cloudant-service-policy.ibm_resource_instance.cloudant_instance[0]: Creating...
module.cloudant-service-policy.ibm_iam_service_id.serviceID[0]: Creation complete after 1s [id=ServiceId-b156d5c6-9632-4fbe-9539-e0c27f00a681]
module.cloudant-service-policy.ibm_resource_instance.cloudant_instance[0]: Still creating... [10s elapsed]
module.cloudant-service-policy.ibm_resource_instance.cloudant_instance[0]: Still creating... [20s elapsed]
module.cloudant-service-policy.ibm_resource_instance.cloudant_instance[0]: Still creating... [30s elapsed]
module.cloudant-service-policy.ibm_resource_instance.cloudant_instance[0]: Still creating... [40s elapsed]
module.cloudant-service-policy.ibm_resource_instance.cloudant_instance[0]: Still creating... [50s elapsed]
module.cloudant-service-policy.ibm_resource_instance.cloudant_instance[0]: Still creating... [1m0s elapsed]
module.cloudant-service-policy.ibm_resource_instance.cloudant_instance[0]: Still creating... [1m10s elapsed]
module.cloudant-service-policy.ibm_resource_instance.cloudant_instance[0]: Still creating... [1m20s elapsed]
module.cloudant-service-policy.ibm_resource_instance.cloudant_instance[0]: Still creating... [1m30s elapsed]
module.cloudant-service-policy.ibm_resource_instance.cloudant_instance[0]: Creation complete after 1m38s [id=crn:v1:bluemix:public:cloudantnosqldb:us-east:a/ab3ed67929c2a81285fbb5f9eb22800a:18c71f8d-12a8-4e9c-a0ac-db06dd956eb6::]
module.cloudant-service-policy.ibm_iam_service_policy.policy: Creating...
module.cloudant-service-policy.ibm_resource_key.resourceKey[0]: Creating...
module.cloudant-service-policy.ibm_iam_service_policy.policy: Creation complete after 3s [id=ServiceId-b156d5c6-9632-4fbe-9539-e0c27f00a681/fadc195b-94a1-4494-8be9-cd0afd8c2ce3]
module.cloudant-service-policy.ibm_resource_key.resourceKey[0]: Creation complete after 6s [id=crn:v1:bluemix:public:cloudantnosqldb:us-east:a/ab3ed67929c2a81285fbb5f9eb22800a:18c71f8d-12a8-4e9c-a0ac-db06dd956eb6:resource-key:aeb3eae4-d4f7-4b0c-af67-31d631e072a1]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.



anilkumarnagaraj@anis-MacBook-Pro cloudant-instance % terraform apply
var.instance_name
  Name of the instance

  Enter a value: test01

var.plan
  plan type (standard and lite)

  Enter a value: standard

var.region
  Provisioning Region

  Enter a value: us-east

var.resource_group
  Enter resource group name

  Enter a value: default

var.resource_key_name
  Name of the instance key

  Enter a value: test_key_02

var.role
  plan type

  Enter a value: Writer

data.ibm_resource_group.cloudant: Refreshing state...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cloudant-instance.ibm_resource_instance.cloudant_instance will be created
  + resource "ibm_resource_instance" "cloudant_instance" {
      + account_id              = (known after apply)
      + allow_cleanup           = (known after apply)
      + created_at              = (known after apply)
      + created_by              = (known after apply)
      + crn                     = (known after apply)
      + dashboard_url           = (known after apply)
      + deleted_at              = (known after apply)
      + deleted_by              = (known after apply)
      + extensions              = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + last_operation          = (known after apply)
      + location                = "us-east"
      + locked                  = (known after apply)
      + name                    = "test01"
      + plan                    = "standard"
      + plan_history            = (known after apply)
      + resource_aliases_url    = (known after apply)
      + resource_bindings_url   = (known after apply)
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group_crn      = (known after apply)
      + resource_group_id       = "7aecd76f87f54ac0876e2f72f88ccb24"
      + resource_group_name     = (known after apply)
      + resource_id             = (known after apply)
      + resource_keys_url       = (known after apply)
      + resource_name           = (known after apply)
      + resource_plan_id        = (known after apply)
      + resource_status         = (known after apply)
      + restored_at             = (known after apply)
      + restored_by             = (known after apply)
      + scheduled_reclaim_at    = (known after apply)
      + scheduled_reclaim_by    = (known after apply)
      + service                 = "cloudantnosqldb"
      + service_endpoints       = (known after apply)
      + state                   = (known after apply)
      + status                  = (known after apply)
      + sub_type                = (known after apply)
      + tags                    = (known after apply)
      + target_crn              = (known after apply)
      + type                    = (known after apply)
      + update_at               = (known after apply)
      + update_by               = (known after apply)

      + timeouts {}
    }

  # module.cloudant-instance.ibm_resource_key.resourceKey[0] will be created
  + resource "ibm_resource_key" "resourceKey" {
      + account_id            = (known after apply)
      + created_at            = (known after apply)
      + created_by            = (known after apply)
      + credentials           = (sensitive value)
      + crn                   = (known after apply)
      + deleted_at            = (known after apply)
      + deleted_by            = (known after apply)
      + guid                  = (known after apply)
      + iam_compatible        = (known after apply)
      + id                    = (known after apply)
      + name                  = "test_key_02"
      + resource_group_id     = (known after apply)
      + resource_instance_id  = (known after apply)
      + resource_instance_url = (known after apply)
      + role                  = "Writer"
      + source_crn            = (known after apply)
      + state                 = (known after apply)
      + status                = (known after apply)
      + updated_at            = (known after apply)
      + updated_by            = (known after apply)
      + url                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.cloudant-instance.ibm_resource_instance.cloudant_instance: Creating...
module.cloudant-instance.ibm_resource_instance.cloudant_instance: Still creating... [10s elapsed]
module.cloudant-instance.ibm_resource_instance.cloudant_instance: Still creating... [20s elapsed]
module.cloudant-instance.ibm_resource_instance.cloudant_instance: Still creating... [30s elapsed]
module.cloudant-instance.ibm_resource_instance.cloudant_instance: Still creating... [40s elapsed]
module.cloudant-instance.ibm_resource_instance.cloudant_instance: Still creating... [50s elapsed]
module.cloudant-instance.ibm_resource_instance.cloudant_instance: Still creating... [1m0s elapsed]
module.cloudant-instance.ibm_resource_instance.cloudant_instance: Still creating... [1m10s elapsed]
module.cloudant-instance.ibm_resource_instance.cloudant_instance: Creation complete after 1m19s [id=crn:v1:bluemix:public:cloudantnosqldb:us-east:a/ab3ed67929c2a81285fbb5f9eb22800a:783add06-fe7f-4f28-b529-e057cf07b15f::]
module.cloudant-instance.ibm_resource_key.resourceKey[0]: Creating...
module.cloudant-instance.ibm_resource_key.resourceKey[0]: Creation complete after 8s [id=crn:v1:bluemix:public:cloudantnosqldb:us-east:a/ab3ed67929c2a81285fbb5f9eb22800a:783add06-fe7f-4f28-b529-e057cf07b15f:resource-key:68d6ebd7-f58c-4c03-9433-82ee98b1e82f]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.